dannyvondenhoerbergen/micropython/ports/tm4c123/mods/i2c.c
    if (self->err_reg == I2C_MASTER_ERR_NONE)
    {
        return (num_of_ack + 1);
    }
    else
    {
        ((self->err_reg & I2C_MASTER_ERR_ADDR_ACK) == I2C_MASTER_ERR_ADDR_ACK) ? nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Device address not found on bus")) : nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "No Data ACK"));
    }
}

STATIC uint8_t machine_hard_i2c_send(mp_obj_base_t *self_in, uint8_t dev_addr, size_t size, uint8_t *buf)
{
    uint8_t num_of_ack = 0;
    uint8_t *plocal_buf = buf;
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

    initialize_i2c_write((mp_obj_t *)self_in, dev_addr);
    machine_hard_i2c_start(self_in);

    num_of_ack = i2c_write_bytes_to_bus((mp_obj_t *)self_in, plocal_buf, size);

    machine_hard_i2c_stop(self_in);

    if (self->err_reg == I2C_MASTER_ERR_NONE)
    {
        return (num_of_ack + 1);
    }
    else
    {
        ((self->err_reg & I2C_MASTER_ERR_ADDR_ACK) == I2C_MASTER_ERR_ADDR_ACK) ? nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Device address not found on bus")) : nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "No Data ACK"));
    }
}

STATIC uint8_t machine_hard_i2c_mem_write(mp_obj_base_t *self_in, uint8_t dev_addr, uint16_t mem_address, size_t size, uint8_t *buf, uint8_t size_mem_addr)
{
    uint8_t num_of_ack = 0;
    uint8_t *plocal_buf = buf;
    uint8_t mem_loc_local8bit = 0x00;
    uint16_t mem_loc_local16bit = 0x0000;
    uint8_t *pmem_loc = (uint8_t *)&mem_loc_local16bit;

    // check for address size
    if (size_mem_addr == 8)
    {
        mem_loc_local8bit = (uint8_t)(mem_address & 0x00FF);
    }
    else
    {
        // send MSB first
        *(pmem_loc + 1) = (uint8_t)(mem_address & 0x00FF);
        *pmem_loc = (uint8_t)((mem_address >> 8) & 0x00FF);
    }

    initialize_i2c_write((mp_obj_t *)self_in, dev_addr);
    machine_hard_i2c_start(self_in);

    if (size_mem_addr == 8)
    {
        num_of_ack = i2c_write_bytes_to_bus((mp_obj_t *)self_in, &mem_loc_local8bit, 1);
    }
    else
    {
        num_of_ack = i2c_write_bytes_to_bus((mp_obj_t *)self_in, (uint8_t *)&mem_loc_local16bit, 2);
    }

    num_of_ack += i2c_write_bytes_to_bus((mp_obj_t *)self_in, plocal_buf, size);

    machine_hard_i2c_stop(self_in);

    return num_of_ack;
}

STATIC void machine_hard_i2c_readinto(mp_obj_base_t *self_in, uint8_t *buf, uint8_t buf_size, uint8_t nack)
{
    uint8_t *plocal_buf = buf;

    // read bytes from bus into given buffer
    i2c_read_bytes_from_bus((mp_obj_t *)self_in, plocal_buf, buf_size, 1);
}

STATIC void machine_hard_i2c_mem_read(mp_obj_base_t *self_in, uint8_t *buf, uint8_t dev_address, uint16_t mem_address, uint8_t buf_size, uint8_t addr_size, uint32_t timeout)
{
    uint8_t *local_buf = buf;
    uint8_t mem_loc_local8bit = 0x00;
    uint16_t mem_loc_local16bit = 0x0000;
    uint8_t *pmem_loc = (uint8_t *)&mem_loc_local16bit;
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

    I2CMasterTimeoutSet(self->i2c_base, timeout);

    // check for address size
    if (addr_size == 8)
    {
        mem_loc_local8bit = (uint8_t)(mem_address & 0x00FF);
    }
    else
    {
        // send MSB first
        *(pmem_loc + 1) = (uint8_t)(mem_address & 0x00FF);
        *pmem_loc = (uint8_t)((mem_address >> 8) & 0x00FF);
    }

    // set msa reg and direction bit
    initialize_i2c_write((mp_obj_t *)self_in, dev_address);

    // start transfer
    machine_hard_i2c_start(self_in);

    // send mem location to either 8 or 16 bit mem location
    (addr_size == 8) ? i2c_write_bytes_to_bus((mp_obj_t *)self_in, &mem_loc_local8bit, 1) : i2c_write_bytes_to_bus((mp_obj_t *)self_in, (uint8_t *)&mem_loc_local16bit, 2);

    // repeated start for receive
    initialize_i2c_read((mp_obj_t *)self_in, dev_address);

    // read from bus
    i2c_read_bytes_from_bus((mp_obj_t *)self_in, local_buf, buf_size, 1);
}

STATIC mp_obj_t machine_hard_i2c_recv(mp_obj_base_t *self_in, uint8_t dev_address, uint8_t *buf, uint8_t nbytes)
{
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;
    uint8_t *local_buffer;

    local_buffer = buf;

    initialize_i2c_read((mp_obj_t *)self_in, dev_address);
    machine_hard_i2c_start((mp_obj_base_t *)self_in);

    // read bytes from bus into buffer
    i2c_read_bytes_from_bus((mp_obj_t *)self, local_buffer, nbytes, 1);

    mp_printf(MP_PYTHON_PRINTER, "finished bytes_from_bus\n");

    // terminate i2c read with stop
    machine_hard_i2c_stop(self_in);

    return mp_const_none;
}

STATIC mp_obj_t machine_hard_i2c_scan(mp_obj_base_t *self_in)
{
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

    mp_obj_t list = mp_obj_new_list(0, NULL);

    I2CMasterDataPut(self->i2c_base, 0);

    for (uint addr = 0x08; addr <= 0x77; addr++)
    {
        initialize_i2c_write((mp_obj_t *)self_in, addr);
        // send start condition, address byte and bit for write direction to slave device
        I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_SINGLE_SEND);

        // wait for Master Control Unit to finish transaction
        while (I2CMasterBusy(self->i2c_base))
        {
        }

        // check for errors
        if (I2CMasterErr(self->i2c_base) == I2C_MASTER_ERR_NONE)
        {
            // if error occured, cancel write routine
            mp_obj_list_append(list, MP_OBJ_NEW_SMALL_INT(addr));
        }
    }

    return list;
}

STATIC bool machine_hard_i2c_is_ready(mp_obj_base_t *self_in, uint8_t dev_addr)
{
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

    I2CMasterDataPut(self->i2c_base, 0);

    initialize_i2c_write((mp_obj_t *)self_in, dev_addr);
    // send start condition, address byte and bit for write direction to slave device
    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_SINGLE_SEND);

    // wait for Master Control Unit to finish transaction
    while (I2CMasterBusy(self->i2c_base))
    {
    }

    // check for errors
    if (I2CMasterErr(self->i2c_base) == I2C_MASTER_ERR_NONE)
    {
        // if error occured, cancel write routine
        return true;
    }
    else
    {
        return false;
    }
}

