dannyvondenhoerbergen/micropython/ports/tm4c123/mods/i2c.c
/* MP WRAPPING FUNCTIONS*/

STATIC mp_obj_t mp_machine_i2c_is_ready(mp_obj_t self, mp_obj_t dev_addr)
{
    uint8_t addr = mp_obj_get_int(dev_addr);
    if (machine_hard_i2c_is_ready((mp_obj_base_t *)self, addr) == true)
    {
        return mp_const_true;
    }
    else
    {
        return mp_const_false;
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(mp_machine_i2c_is_ready_obj, mp_machine_i2c_is_ready);

STATIC mp_obj_t mp_machine_i2c_start(mp_obj_t self)
{

    machine_hard_i2c_start((mp_obj_base_t *)self);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(mp_machine_i2c_start_obj, mp_machine_i2c_start);

STATIC mp_obj_t mp_machine_hard_i2c_readinto(mp_obj_t self, mp_obj_t buf, mp_obj_t nack)
{
    // get read buffer pointer from mp
    mp_buffer_info_t i2c_read_buf;
    mp_get_buffer_raise(buf, &i2c_read_buf, MP_BUFFER_WRITE);

    // get NACK
    uint8_t int_nack = mp_obj_get_int(nack);

    // pass to c-interface function
    machine_hard_i2c_readinto(self, (uint8_t *)i2c_read_buf.buf, i2c_read_buf.len, int_nack);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(mp_machine_hard_i2c_readinto_obj, mp_machine_hard_i2c_readinto);

STATIC mp_obj_t mp_machine_hard_i2c_write(mp_obj_t self_in, mp_obj_t wr_buf)
{
    // get write buffer
    mp_buffer_info_t i2c_data;
    mp_get_buffer_raise(wr_buf, &i2c_data, MP_BUFFER_READ);

    // write bytes to bus and return number of acks
    return mp_obj_new_int((mp_int_t)machine_hard_i2c_write((mp_obj_base_t *)self_in, (uint8_t *)i2c_data.buf, i2c_data.len));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(mp_machine_hard_i2c_write_obj, mp_machine_hard_i2c_write);

STATIC mp_obj_t mp_machine_hard_i2c_recv(mp_obj_t self_in, mp_obj_t nbytes, mp_obj_t dev_addr)
{

    // casting Micropython data types to c data types
    uint8_t int_nbytes = mp_obj_get_int(nbytes);
    uint8_t int_dev_address = mp_obj_get_int(dev_addr);

    vstr_t vstr;
    vstr_init_len(&vstr, int_nbytes);

    // read bytes into vstr buffer
    machine_hard_i2c_recv((mp_obj_base_t *)self_in, int_dev_address, (uint8_t *)vstr.buf, vstr.len);

    // return vstr buffer
    return mp_obj_new_str_from_vstr(&mp_type_bytes, &vstr);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(mp_machine_hard_i2c_recv_obj, mp_machine_hard_i2c_recv);

STATIC mp_obj_t mp_machine_hard_i2c_mem_read(size_t n_args, const mp_obj_t *args)
{
    uint8_t addr_size = 8;
    uint32_t timeout = 0x7A12;
    // casting Micropython data types to c data types

    // get buffer to read to
    mp_buffer_info_t i2c_data;
    mp_get_buffer_raise(args[1], &i2c_data, MP_BUFFER_READ);

    // get device address
    uint8_t int_dev_address = mp_obj_get_int(args[2]);

    // get stop
    uint16_t int_mem_addr = mp_obj_get_int(args[3]);

    if ((n_args == 5) || (n_args == 6))
    {
        addr_size = mp_obj_get_int(args[4]);

        if (!((addr_size == 16) || (addr_size == 8)))
        {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "addr_size can only be 8 or 16 bits"));
        }
    }

    if (n_args == 6)
    {
        timeout = mp_obj_get_int(args[5]);
        timeout *= 6;
    }

    // pass to c-interface function
    machine_hard_i2c_mem_read(args[0], i2c_data.buf, int_dev_address, int_mem_addr, i2c_data.len, addr_size, timeout);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_mem_read_obj, 4, 6, mp_machine_hard_i2c_mem_read);

STATIC mp_obj_t mp_machine_hard_i2c_send(mp_obj_t self_in, mp_obj_t data, mp_obj_t dev_addr)
{
    // casting Micropython data types to c data types
    uint8_t int_dev_address = mp_obj_get_int(dev_addr);
    mp_buffer_info_t i2c_data;
    mp_get_buffer_raise(data, &i2c_data, MP_BUFFER_READ);

    // calling I2C-Send Function
    machine_hard_i2c_send((mp_obj_base_t *)self_in, int_dev_address, i2c_data.len, (uint8_t *)i2c_data.buf);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(mp_machine_hard_i2c_send_obj, mp_machine_hard_i2c_send);

/* Write Function */

STATIC mp_obj_t mp_machine_hard_i2c_mem_write(size_t n_args, const mp_obj_t *args)
{
    // casting Micropython data types to c data types
    mp_buffer_info_t i2c_data;
    mp_get_buffer_raise(args[1], &i2c_data, MP_BUFFER_READ);
    uint8_t int_dev_address = mp_obj_get_int(args[2]);
    uint16_t int_mem_address = mp_obj_get_int(args[3]);
    uint8_t int_mem_addr_size = 0x00;

    if (n_args == 5)
    {
        int_mem_addr_size = mp_obj_get_int(args[4]);
    }
    else if (n_args == 4)
    {
        int_mem_addr_size = 8;
    }
    // calling I2C-Send Function
    machine_hard_i2c_mem_write(args[0], int_dev_address, int_mem_address, i2c_data.len, (uint8_t *)i2c_data.buf, int_mem_addr_size);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_mem_write_obj, 4, 5, mp_machine_hard_i2c_mem_write);

/* Scan Function */

STATIC mp_obj_t mp_machine_hard_i2c_scan(mp_obj_t self)
{
    return machine_hard_i2c_scan(self);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(mp_machine_hard_i2c_scan_obj, mp_machine_hard_i2c_scan);

/* DeInit Function */

STATIC mp_obj_t i2c_deinit(mp_obj_t self_in)
{
    deinitI2C0(&self_in);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(i2c_deinit_obj, i2c_deinit);

/* Init Helper Function */

STATIC mp_obj_t machine_hard_i2c_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args)
{
    return machine_hard_i2c_init_helper(args[0], n_args - 1, args + 1, kw_args);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_i2c_init_obj, 1, machine_hard_i2c_init);

/*
	Define uPy-Fuctions
*/

/*
	Table with all globals
*/
STATIC const mp_rom_map_elem_t machine_hard_i2c_locals_dict_table[] = {
    // methods
    {MP_OBJ_NEW_QSTR(MP_QSTR___name__), MP_OBJ_NEW_QSTR(MP_QSTR_i2c)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_i2c_init_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_is_ready), MP_ROM_PTR(&mp_machine_i2c_is_ready_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_start), MP_ROM_PTR(&mp_machine_i2c_start_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_readinto), MP_ROM_PTR(&mp_machine_hard_i2c_readinto_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_write), MP_ROM_PTR(&mp_machine_hard_i2c_write_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_recv), MP_ROM_PTR(&mp_machine_hard_i2c_recv_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_mem_read), MP_ROM_PTR(&mp_machine_hard_i2c_mem_read_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_send), MP_ROM_PTR(&mp_machine_hard_i2c_send_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_mem_write), MP_ROM_PTR(&mp_machine_hard_i2c_mem_write_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_scan), MP_ROM_PTR(&mp_machine_hard_i2c_scan_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&i2c_deinit_obj)},

    // constants
    {MP_ROM_QSTR(MP_QSTR_MASTER), MP_ROM_INT(I2C_MODE_MASTER)},
    {MP_ROM_QSTR(MP_QSTR_SLAVE), MP_ROM_INT(I2C_MODE_SLAVE)},
};

